---
kind: type
id: T:Autodesk.Revit.DB.FamilyInstanceReferenceType
source: html/ab424c61-4b80-9dcd-3f9a-7b35fa670edf.htm
---
# Autodesk.Revit.DB.FamilyInstanceReferenceType

Corresponds to the possible values of parameter "Is Reference" of reference planes and parameter "Reference" of reference lines in families.
 This enum is used to identify references of family instances corresponding to reference planes and reference lines in the family.

## Syntax (C#)
```csharp
public enum FamilyInstanceReferenceType
```